------------- ФАЙЛ ПІД ПОСТГРЕС ----------

-- HOMEWORK
-- Завдання 1
-- Створіть базу даних під назвою Birds. Розташування залишається на ваш вибір.
CREATE DATABASE Birds

-- Завдання 2
-- Переназвіть базу даних із першого завдання. Нове ім’я
-- для бази даних Cats.
ALTER DATABASE Birds RENAME TO Cats

-- Завдання 3
-- Видаліть базу даних Cats.
DROP DATABASE IF EXISTS Cats

--------- ФАЙЛ САМОЇ БД -----------------

-- Створіть однотабличну базу даних «Овочі та фрукти»,
-- яка зберігатиме таку інформацію:
-- ■ Назва;
-- ■ Тип (овоч або фрукт);
-- ■ Колір;
-- ■ Калорійність;
-- ■ Короткий опис

CREATE TABLE FV (
	FV_NAME VARCHAR(50),
	FV_TYPE VARCHAR(9),
	COLOR VARCHAR(10),
	CCAL SMALLINT,
	OPIS VARCHAR(1000)
)

INSERT INTO FV (FV_NAME, FV_TYPE, COLOR, CCAL, OPIS) VALUES
('Яблуко', 'Фрукт', 'Червоний', 52, 'Соковитий та солодкий плід, багатий на вітаміни.'),
('Банан', 'Фрукт', 'Жовтий', 89, 'Містить багато калію, ідеальний для швидкого перекусу.'),
('Морква', 'Овоч', 'Оранжевий', 41, 'Коренеплід, багатий на бета-каротин.'),
('Помідор', 'Овоч', 'Червоний', 18, 'Низькокалорійний, містить лікопін та вітамін С.'),
('Огірок', 'Овоч', 'Зелений', 15, 'Містить багато води, освіжаючий та низькокалорійний.'),
('Апельсин', 'Фрукт', 'Оранжевий', 47, 'Цитрус, багатий на вітамін С.'),
('Картопля', 'Овоч', 'Коричневий', 77, 'Джерело крохмалю, популярний гарнір.'),
('Полуниця', 'Фрукт', 'Червоний', 32, 'Ароматна ягода, багата на антиоксиданти.'),
('Капуста', 'Овоч', 'Зелений', 25, 'Листовий овоч, багатий на клітковину та вітаміни.'),
('Вишня', 'Фрукт', 'Вишневий', 50, 'Солодко-кислий плід, корисний для серця.'),
('Гарбуз', 'Овоч', 'Оранжевий', 26, 'Осінній овоч, використовується в супах та випічці.'),
('Лимон', 'Фрукт', 'Жовтий', 29, 'Кислий цитрус, популярний у напоях та стравах.'),
('Часник', 'Овоч', 'Білий', 149, 'Ароматний овоч, що має антибактеріальні властивості.'),
('Груша', 'Фрукт', 'Зелений', 57, 'Солодкий фрукт з ніжною текстурою.'),
('Редис', 'Овоч', 'Червоний', 16, 'Гоструватий овоч, додає пікантності салатам.');

-- Створіть наступні запити для таблиці з інформацією про
-- овочі та фрукти із попереднього завдання:
-- ■ Відображення всієї інформації з таблиці овочів та фруктів;
SELECT *
FROM FV

-- ■ Відображення усіх овочів;
SELECT *
FROM FV
WHERE FV_TYPE = 'Овоч'

-- ■ Відображення усіх фруктів;
SELECT *
FROM FV
WHERE FV_TYPE = 'Фрукт'

-- ■ Відображення усіх назв овочів та фруктів;
SELECT FV_NAME
FROM FV

-- ■ Відображення усіх кольорів. Кольори мають бути унікальними;
SELECT DISTINCT COLOR
FROM FV

-- ■ Відображення фруктів певного кольору;
SELECT *
FROM FV
WHERE FV_TYPE = 'Фрукт' AND COLOR = 'Червоний'

-- ■ Відображення овочів певного кольору
SELECT *
FROM FV
WHERE FV_TYPE = 'Овоч' AND COLOR = 'Червоний'